import random, os


def cls():
    os.system('cls' if os.name=='nt' else 'clear')

wordList = ['год', 'раз', 'дом', 'мир', 'вид', 'час', 'бог', 'имя', 'суд', 'век', 'сын', 'муж', 'ряд', 'ход', 'лес', 'зал', 'шаг', 'тип', 'пол', 'род', 'дух', 'сон', 'ухо', 'нос',
'сад', 'рот', 'бой', 'зуб', 'акт', 'дед', 'чай', 'газ', 'май', 'шея', 'том', 'лоб', 'бок', 'дело', 'день', 'рука', 'лицо', 'друг', 'глаз', 'сила', 'вода', 'отец',
'нога', 'ночь', 'стол', 'жена', 'свет', 'пора', 'путь', 'душа', 'мать', 'язык', 'мама', 'цель', 'утро', 'роль', 
'тело', 'труд', 'мера', 'окно', 'идея', 'счет', 'вещь', 'цена', 'план', 'речь', 'срок', 'опыт', 'член', 'брат', 'игра', 'рост',
'тема', 'край', 'небо', 'поле', 'банк', 'союз', 'врач', 'факт', 'угол', 'двор', 'вера', 'цвет', 'море', 'круг',
'поэт', 'пара', 'удар', 'база', 'папа', 'губа', 'дочь', 'лето', 'курс', 'река', 'фонд', 'лист', 'воля', 'снег',
'итог', 'зона', 'гора', 'метр', 'боль', 'звук', 'доля', 'враг', 'этап', 'черт', 'кожа', 'знак', 'дядя', 'учет',
'хлеб', 'зима', 'сеть', 'суть', 'клуб', 'этаж', 'кино', 'долг', 'тень', 'храм', 'ужас', 'март', 'дама', 'стул', 
'след', 'рыба', 'дума', 'чудо', 'мозг', 'пост', 'июнь', 'дача', 'баба', 'вино', 'спор', 'вкус', 'ключ', 'слой',
'июль', 'слух', 'время', 'жизнь', 'слово', 'место', 'конец', 'часть', 'город', 'земля', 'право', 'дверь', 'образ',
'закон', 'война', 'голос', 'книга', 'число', 'народ', 'форма', 'связь', 'улица', 'вечер', 'мысль', 'месяц', 'школа',
'театр', 'рубль', 'смысл', 'орган', 'рынок', 'семья', 'центр', 'ответ', 'автор', 'стена', 'совет', 'глава', 'наука',
'плечо', 'точка', 'палец', 'номер', 'метод', 'фильм', 'гость', 'кровь', 'район', 'армия', 'класс', 'герой', 'спина',
'сцена', 'объем', 'берег', 'фирма', 'завод', 'песня', 'роман', 'стихи', 'повод', 'успех', 'выход', 'текст', 'пункт',
'линия', 'среда', 'волос', 'ветер', 'огонь', 'грудь', 'страх', 'сумма', 'сфера', 'мужик', 'немец', 'выбор', 'масса',
'слава', 'кухня', 'отдел', 'товар', 'актер', 'слеза', 'вывод', 'норма', 'рамка', 'прием', 'режим', 'целое', 'вирус',
'поиск', 'налог', 'доход', 'карта', 'акция', 'сосед', 'фраза', 'толпа', 'схема', 'волна', 'птица', 'запах', 'водка',
'поезд', 'адрес', 'лидер', 'стиль', 'весна', 'эпоха', 'запад', 'тайна', 'трава', 'фронт', 'музей', 'князь', 'сутки',
'судья', 'крыша', 'поток', 'честь', 'еврей', 'сотня', 'дождь', 'труба', 'осень', 'пьеса', 'черта', 'кусок', 'работа',
'вопрос', 'страна', 'случай', 'голова', 'деньги', 'машина', 'власть', 'тысяча', 'статья', 'группа', 'начало', 'минута',
'дорога', 'любовь', 'взгляд', 'момент', 'письмо', 'помощь', 'смерть', 'задача', 'партия', 'сердце', 'неделя', 'газета',
'основа', 'данные', 'мнение', 'проект', 'служба', 'судьба', 'состав', 'объект', 'период', 'пример', 'воздух', 'борьба',
'размер', 'доллар', 'музыка', 'правда', 'память', 'дерево', 'хозяин', 'солнце', 'способ', 'журнал', 'оценка', 'регион',
'анализ', 'бумага', 'модель', 'старик', 'ребята', 'знание', 'защита', 'доктор', 'солдат', 'оружие', 'парень', 'зрение', 
'услуга', 'бизнес', 'собака', 'камень', 'здание', 'бюджет', 'победа', 'звезда', 'сестра', 'карман', 'войско', 'офицер',
'предел', 'выборы', 'ученый', 'теория', 'клетка', 'расчет', 'ошибка', 'колено', 'стекло', 'высота', 'трубка', 'мастер',
'подход', 'ресурс', 'улыбка', 'артист', 'фигура', 'список', 'усилие', 'остров', 'житель', 'одежда', 'кресло', 'ладонь',
'цветок', 'январь', 'фактор', 'август', 'охрана', 'расход', 'родина', 'лагерь', 'клиент', 'беседа', 'апрель', 'кодекс',
'костюм', 'лошадь', 'ученик', 'приказ', 'жертва', 'восток', 'польза', 'звонок', 'деталь', 'человек', 'сторона', 'ребенок',
'система', 'женщина', 'решение', 'история', 'область', 'процесс', 'условие', 'уровень', 'комната', 'порядок', 'интерес',
'правило', 'мужчина', 'чувство', 'причина', 'товарищ', 'встреча', 'девушка', 'очередь', 'событие', 'принцип', 'мальчик',
'участие', 'девочка', 'картина', 'рисунок', 'течение', 'церковь', 'свобода', 'команда', 'договор', 'природа', 'телефон',
'позиция', 'самолет', 'процент', 'степень', 'надежда', 'предмет', 'вариант', 'министр', 'граница', 'миллион', 'счастье',
'кабинет', 'магазин', 'площадь', 'возраст', 'участок', 'желание', 'генерал', 'понятие', 'радость', 'продукт', 'реформа',
'будущее', 'рассказ', 'техника', 'деревня', 'элемент', 'функция', 'капитан', 'фамилия', 'бутылка', 'влияние', 'учитель',
'корабль', 'детство', 'прошлое', 'коридор', 'болезнь', 'попытка', 'депутат', 'комитет', 'десяток', 'глубина', 'студент',
'секунда', 'станция', 'бабушка', 'столица', 'энергия', 'субъект', 'реакция', 'отличие', 'красота', 'явление', 'наличие',
'больной', 'декабрь', 'октябрь', 'занятие', 'зритель', 'концерт', 'милиция', 'переход', 'кровать', 'аппарат', 'отрасль',
'продажа', 'образец', 'главное', 'таблица', 'коллега', 'оборона', 'подруга', 'признак', 'перевод', 'проблема', 'компания',
'развитие', 'средство', 'качество', 'действие', 'общество', 'ситуация', 'квартира', 'внимание', 'разговор', 'движение',
'материал', 'культура', 'документ', 'институт', 'директор', 'создание', 'значение', 'характер', 'политика', 'писатель',
'родитель', 'половина', 'господин', 'операция', 'название', 'сознание', 'участник', 'художник', 'комплекс', 'контроль',
'источник', 'практика', 'комиссия', 'работник', 'личность', 'праздник', 'читатель', 'командир', 'собрание', 'здоровье',
'скорость', 'режиссер', 'ощущение', 'механизм', 'передача', 'рождение', 'больница', 'существо', 'свойство', 'животное',
'страница', 'растение', 'традиция', 'сведение', 'сентябрь', 'редакция', 'известие', 'выставка', 'середина', 'сомнение',
'лестница', 'ценность', 'организм', 'открытие', 'ресторан', 'километр', 'чиновник', 'отношение', 'результат', 'президент',
'состояние', 'программа', 'положение', 'федерация', 'искусство', 'структура', 'гражданин', 'начальник', 'изменение', 'население',
'спектакль', 'основание', 'экономика', 'сотрудник', 'продукция', 'хозяйство', 'множество', 'частность', 'профессор', 'поддержка',
'заявление', 'сравнение', 'выражение', 'революция', 'поведение', 'сожаление', 'стоимость', 'журналист', 'нарушение', 'заседание',
'поколение', 'противник', 'помещение', 'отделение', 'имущество', 'повышение', 'полковник', 'понимание', 'должность', 'установка',
'появление', 'получение', 'секретарь', 'информация', 'управление', 'количество', 'территория', 'специалист', 'требование', 'автомобиль',
'литература', 'содержание', 'технология', 'отсутствие', 'подготовка', 'республика', 'проведение', 'применение', 'разработка', 'показатель',
'исполнение', 'фотография', 'реализация', 'настроение', 'учреждение', 'выполнение', 'американец', 'заключение', 'исключение', 'обстановка',
'соглашение', 'возможность', 'государство', 'организация', 'предприятие', 'образование', 'направление', 'большинство', 'руководство', 'предложение',
'определение', 'обеспечение', 'особенность', 'впечатление', 'поверхность', 'способность', 'заместитель', 'университет', 'зависимость', 'обязанность',
'выступление', 'температура', 'перспектива', 'деятельность', 'производство', 'исследование', 'руководитель', 'пространство', 'председатель',
'соответствие', 'безопасность', 'удовольствие', 'министерство', 'формирование', 'оборудование', 'произведение', 'преступление', 'воспоминание',
'правительство', 'использование', 'представитель', 'представление', 'строительство', 'необходимость', 'существование', 'администрация',
'собственность', 'постановление', 'обстоятельство', 'характеристика', 'промышленность']

while True:

    try:
        difficulty = input('Выберите сложеность (мин. - 3, макс. - 14) \n')
        difficulty = int(difficulty)
        if difficulty < 3 or difficulty > 14:
            print('Введите сложность от 3 до 14\n')
            continue
    except:
        print('Введите значение сложности в цифровом формате!\n')
    
    listOfWords = []

    for i in wordList:
        if len(i) < difficulty:
            continue
        elif len(i) > difficulty:
            break
        else:
            listOfWords.append(i)

    secretWord = listOfWords[random.randint(0, len(listOfWords) - 1)]

    def display_hangman(tries):
        if tries > 6:
            tries = 6
            
        stages = [  # финальное состояние: голова, торс, обе руки, обе ноги
                    '''
                        _______________________________________
                        ___$$$$$$$$$$______Я-ВИСЕЛИЦА!_________
                        ___$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$___
                        ______Z___________________$$$$$$$______
                        ______Z___________________$$$$$$$______
                        ______Z___________________$$$$$$$______
                        _____$$$__________________$$$$$$$______
                        ____$0$0$_________________$$$$$$$______
                        _____$O$__________________$$$$$$$______
                        ___$00000$________________$$$$$$$______
                        __$$$$$$$$$_______________$$$$$$$______
                        __$_$$$$$_$_______________$$$$$$$______
                        __$_$$$$$_$_______________$$$$$$$______
                        __$_$$$$$_$_______________$$$$$$$______
                        ____$$_$$_________________$$$$$$$______
                        ___$$___$$________________$$$$$$$______
                        ___$$___$$________________$$$$$$$______
                        ___$$___$$_____________$$$$$$$$$$$$$___
                        $__$$___$$__$$$$$$$$$$$$$$$$$$$$$$$$$$$
                        _\_________/_______$$$$$$$$$$$$$$$$$$$$$
                        __\_______/________$$$$$$$$$$$$$$$$$$$$$
                        __________________$$$$$$$$$$$$$$$$$$$$$
                        __________________$$$$$$$$$$$$$$$$$$$$$
                    ''',
                    # голова, торс, обе руки, одна нога
                    '''
                        _______________________________________
                        ___$$$$$$$$$$______Я-ВИСЕЛИЦА!_________
                        ___$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$___
                        ______Z___________________$$$$$$$______
                        ______Z___________________$$$$$$$______
                        ______Z___________________$$$$$$$______
                        _____$$$__________________$$$$$$$______
                        ____$$$$$_________________$$$$$$$______
                        _____$$$__________________$$$$$$$______
                        ___$11111$________________$$$$$$$______
                        __$$$$$$$$$_______________$$$$$$$______
                        __$_$$$$$_$_______________$$$$$$$______
                        __$_$$$$$_$_______________$$$$$$$______
                        __$_$$$$$_$_______________$$$$$$$______
                        ____$$____________________$$$$$$$______
                        ___$$_____________________$$$$$$$______
                        ___$$_____________________$$$$$$$______
                        ___$$__________________$$$$$$$$$$$$$___
                        $__$$_______$$$$$$$$$$$$$$$$$$$$$$$$$$$
                        _\_________/_______$$$$$$$$$$$$$$$$$$$$$
                        __\_______/________$$$$$$$$$$$$$$$$$$$$$
                        __________________$$$$$$$$$$$$$$$$$$$$$
                        __________________$$$$$$$$$$$$$$$$$$$$$
                    ''',
                    # голова, торс, обе руки
                    '''
                        _______________________________________
                        ___$$$$$$$$$$______Я-ВИСЕЛИЦА!_________
                        ___$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$___
                        ______Z___________________$$$$$$$______
                        ______Z___________________$$$$$$$______
                        ______Z___________________$$$$$$$______
                        _____$$$__________________$$$$$$$______
                        ____$$$$$_________________$$$$$$$______
                        _____$$$__________________$$$$$$$______
                        ___$22222$________________$$$$$$$______
                        __$$$$$$$$$_______________$$$$$$$______
                        __$_$$$$$_$_______________$$$$$$$______
                        __$_$$$$$_$_______________$$$$$$$______
                        __$_$$$$$_$_______________$$$$$$$______
                        __________________________$$$$$$$______
                        __________________________$$$$$$$______
                        __________________________$$$$$$$______
                        _______________________$$$$$$$$$$$$$___
                        $___________$$$$$$$$$$$$$$$$$$$$$$$$$$$
                        _\_________/_______$$$$$$$$$$$$$$$$$$$$$
                        __\_______/________$$$$$$$$$$$$$$$$$$$$$
                        __________________$$$$$$$$$$$$$$$$$$$$$
                        __________________$$$$$$$$$$$$$$$$$$$$$
                    ''',
                    # голова, торс и одна рука
                    '''
                        _______________________________________
                        ___$$$$$$$$$$______Я-ВИСЕЛИЦА!_________
                        ___$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$___
                        ______Z___________________$$$$$$$______
                        ______Z___________________$$$$$$$______
                        ______Z___________________$$$$$$$______
                        _____$$$__________________$$$$$$$______
                        ____$$$$$_________________$$$$$$$______
                        _____$$$__________________$$$$$$$______
                        ___$33333_________________$$$$$$$______
                        __$$$$$$$_________________$$$$$$$______
                        __$_$$$$$_________________$$$$$$$______
                        __$_$$$$$_________________$$$$$$$______
                        __$_$$$$$_________________$$$$$$$______
                        __________________________$$$$$$$______
                        __________________________$$$$$$$______
                        __________________________$$$$$$$______
                        _______________________$$$$$$$$$$$$$___
                        $___________$$$$$$$$$$$$$$$$$$$$$$$$$$$
                        _\_________/_______$$$$$$$$$$$$$$$$$$$$$
                        __\_______/________$$$$$$$$$$$$$$$$$$$$$
                        __________________$$$$$$$$$$$$$$$$$$$$$
                        __________________$$$$$$$$$$$$$$$$$$$$$
                    ''',
                    # голова и торс
                    '''
                        _______________________________________
                        ___$$$$$$$$$$______Я-ВИСЕЛИЦА!_________
                        ___$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$___
                        ______Z___________________$$$$$$$______
                        ______Z___________________$$$$$$$______
                        ______Z___________________$$$$$$$______
                        _____$$$__________________$$$$$$$______
                        ____$$$$$_________________$$$$$$$______
                        _____$$$__________________$$$$$$$______
                        ____44444_________________$$$$$$$______
                        ____$$$$$_________________$$$$$$$______
                        ____$$$$$_________________$$$$$$$______
                        ____$$$$$_________________$$$$$$$______
                        ____$$$$$_________________$$$$$$$______
                        __________________________$$$$$$$______
                        __________________________$$$$$$$______
                        __________________________$$$$$$$______
                        _______________________$$$$$$$$$$$$$___
                        $___________$$$$$$$$$$$$$$$$$$$$$$$$$$$
                        _\_________/_______$$$$$$$$$$$$$$$$$$$$$
                        __\_______/________$$$$$$$$$$$$$$$$$$$$$
                        __________________$$$$$$$$$$$$$$$$$$$$$
                        __________________$$$$$$$$$$$$$$$$$$$$$
                    ''',
                    # голова
                    '''
                        _______________________________________
                        ___$$$$$$$$$$______Я-ВИСЕЛИЦА!_________
                        ___$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$___
                        ______Z___________________$$$$$$$______
                        ______Z___________________$$$$$$$______
                        ______Z___________________$$$$$$$______
                        _____$$$__________________$$$$$$$______
                        ____$$$$$_________________$$$$$$$______
                        _____$$$__________________$$$$$$$______
                        ____55555_________________$$$$$$$______
                        __________________________$$$$$$$______
                        __________________________$$$$$$$______
                        __________________________$$$$$$$______
                        __________________________$$$$$$$______
                        __________________________$$$$$$$______
                        __________________________$$$$$$$______
                        __________________________$$$$$$$______
                        _______________________$$$$$$$$$$$$$___
                        $___________$$$$$$$$$$$$$$$$$$$$$$$$$$$
                        _\_________/_______$$$$$$$$$$$$$$$$$$$$$
                        __\_______/________$$$$$$$$$$$$$$$$$$$$$
                        __________________$$$$$$$$$$$$$$$$$$$$$
                        __________________$$$$$$$$$$$$$$$$$$$$$
                    ''',
                    # начальное состояние
                    '''
                        _______________________________________
                        ___$$$$$$$$$$______Я-ВИСЕЛИЦА!_________
                        ___$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$___
                        ______Z___________________$$$$$$$______
                        ______Z___________________$$$$$$$______
                        ______Z___________________$$$$$$$______
                        __________________________$$$$$$$______
                        __________________________$$$$$$$______
                        __________________________$$$$$$$______
                        ____66666_________________$$$$$$$______
                        __________________________$$$$$$$______
                        __________________________$$$$$$$______
                        __________________________$$$$$$$______
                        __________________________$$$$$$$______
                        __________________________$$$$$$$______
                        __________________________$$$$$$$______
                        __________________________$$$$$$$______
                        _______________________$$$$$$$$$$$$$___
                        $___________$$$$$$$$$$$$$$$$$$$$$$$$$$$
                        _\_________/_______$$$$$$$$$$$$$$$$$$$$$
                        __\_______/________$$$$$$$$$$$$$$$$$$$$$
                        __________________$$$$$$$$$$$$$$$$$$$$$
                        __________________$$$$$$$$$$$$$$$$$$$$$
                    '''
        ]
        return stages[tries]

    def print_word(word_param, list_):
        print(word_param[0], end=' ')
        for c in word_param[1:(len(word_param)-1)]:
            if c in list_:
                print(c, end=' ')
            else:
                print('_', end=' ')
        print(word_param[len(word_param)-1])

    def play(word):
        guessed = False
        guessed_letters = []
        guessed_words = []
        tries = 8
        print('\nДобро пожаловать в игру!\n')
        display_hangman(tries)
        word_completion = word[0] + '_' * (len(word) - 2) + word[difficulty-1]
        print(word_completion)
        while True:
            word_input = input('Введите букву или слово: ')
            if not word_input.isalpha():
                print('Вы ошиблись, попробуйте ещё')
                continue
            if word_input in guessed_words or word_input in guessed_letters:
                print('Уже было')
                continue
            if len(word_input) > 1:
                if word_input == word:
                    print('Поздравляем, вы угадали слово! Вы победили!')
                    break
                else:
                    cls()
                    guessed_words.append(word_input)
                    tries -= 1
                    if tries > 6:
                        print(f'Эту ошибку ПРОЩАЮ!!! Осталось попыток {tries}')
                    else:
                        print(f'Не верно, осталось попыток {tries}')
                    print(display_hangman(tries))
                    print_word(word, guessed_letters)
                    if tries == 0:
                        print(f'Вы не смогли угадать слово: {word}')
                        break
                    continue

            if word_input in word[1:difficulty-1]:
                guessed_letters.append(word_input)
                for c in word[1:difficulty-1]:
                    if c not in guessed_letters:
                        print('Угадали букву')
                        print_word(word, guessed_letters)
                        guessed = False
                        break
                    guessed = True
                if guessed:    
                    print_word(word, guessed_letters)
                    print('Поздравляем, вы угадали слово! Вы победили!')
                    break
            else:
                cls()
                guessed_letters.append(word_input)
                tries -= 1
                if tries > 6:
                        print('Эту ошибку ПРОЩАЮ!!!')
                else:
                    print(f'Не верно, осталось попыток {tries}')
                print(display_hangman(tries))
                print_word(word, guessed_letters)
            if tries == 0:
                print(f'Вы не смогли угадать слово: {word}')
                break
    play(secretWord)
